meeting/agenda/2024/09-17.org
:PROPERTIES:
:ID:       312A124D-4A05-45D8-B004-9A7835C1C287
:END:
#+title: QT4 CG Meeting 090 Agenda 2024-09-17
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/09-10.html][the previous meeting]]. 

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 17 September 2024. The following meeting is scheduled
for 24 September.

** Review of open action items [1/8]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-080-07: NW to update the build instructions in the README
+ [ ] QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-087-01: DN to update PR #1228 to reflect MK’s compromise and update the vulnerabilities
+ [ ] QT4CG-088-01: NW to consider how best to add a dedication to MSM.
+ [ ] QT4CG-088-03: MK to add an example of duplicate function-annotations being returned.
+ [ ] QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature
+ [ ] QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.
+ [X] QT4CG-089-02: WP to provide a more complete citation for the CRC-32 algorithm.
  + Shortly after the meeting, WP reported that the “cite this” button on the
    spec landing page proposes: "IEEE Standard for Ethernet," in IEEE Std
    802.3-2022 (Revision of IEEE Std 802.3-2018) , vol., no., pp.1-7025, 29 July
    2022, doi: 10.1109/IEEESTD.2022.9844436.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1355][#1355]]: 1351 Add "declare record" in XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]: 982 Rewrite of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Lookup returning path selection
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1444][#1444]]: Implement improvement to bibligraphy entry for IEEE 802.3
+ PR [[https://qt4cg.org/dashboard/#pr-1414][#1414]]: XSLT spec abstract, introduction

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1389][#1389]]: fn:while-do: Optional error: will not terminate

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-1442][#1442]]: 1394 Add new default priority rules
+ PR [[https://qt4cg.org/dashboard/#pr-1414][#1414]]: XSLT spec abstract, introduction
+ PR [[https://qt4cg.org/dashboard/#pr-1378][#1378]]: 1375 bugs in pattern syntax

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1440][#1440]]: 1387 Another tweak to build-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1439][#1439]]: 1235 Function Identity: Treating function items with identical bodies
+ PR [[https://qt4cg.org/dashboard/#pr-1438][#1438]]: 1322 fn:collation-available (editorial)
+ PR [[https://qt4cg.org/dashboard/#pr-1437][#1437]]: 1325 Variadic System Functions limited to `fn:concat`
+ PR [[https://qt4cg.org/dashboard/#pr-1436][#1436]]: 1323 Function parameters names: $href → $uri
+ PR [[https://qt4cg.org/dashboard/#pr-1435][#1435]]: 1421 fn:unix-time: Revisions
+ PR [[https://qt4cg.org/dashboard/#pr-1434][#1434]]: 1373 XQFO: Editorial
+ PR [[https://qt4cg.org/dashboard/#pr-1433][#1433]]: 1422 fn:hash: Revision
+ PR [[https://qt4cg.org/dashboard/#pr-1432][#1432]]: 1379 Initializing expression: Allow self references
+ PR [[https://qt4cg.org/dashboard/#pr-1431][#1431]]: 1372 Unknown option: FORG0013 → XPTY0004
+ PR [[https://qt4cg.org/dashboard/#pr-1430][#1430]]: 1427 Add element-number function
+ PR [[https://qt4cg.org/dashboard/#pr-1429][#1429]]: 1403 Align type tests
+ PR [[https://qt4cg.org/dashboard/#pr-1364][#1364]]: 1314 Change to type() syntax to fix ambiguity
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1252][#1252]]: Add a new function `fn:html-doc`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1238][#1238]]: XSLT on-no-match="shallow-copy-all" - revised rules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1235][#1235]]: Function Identity: Treating function items with identical bodies
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1169][#1169]]: Maps & Arrays: Consistency & Terminology
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/868][#868]]: fn:intersperse → fn:join, array:join($arrays, $separator)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/767][#767]]: parse-html(): case of SVG element names
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/490][#490]]: Control over schema validation in parse-xml(), doc(), etc.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package
+ Issue [[https://github.com/qt4cg/qtspecs/issues/69][#69]]: fn:document, fn:function-available: default arguments

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1364: Change to type() syntax to fix ambiguity
:PROPERTIES:
:CUSTOM_ID: pr-1364
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1364][#1364]]

** PR #1283: 77b: Update expressions
:PROPERTIES:
:CUSTOM_ID: pr-1283
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]

** PR #1429: Align type tests
:PROPERTIES:
:CUSTOM_ID: pr-1429
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1429][#1429]]

** PR #1430: 1427 Add element-number function
:PROPERTIES:
:CUSTOM_ID: pr-1430
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1430][#1430]].
** PR #1431: 1372 Unknown option: FORG0013 → XPTY0004
:PROPERTIES:
:CUSTOM_ID: pr-1431
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1431][#1431]].
** PR #1432: 1379 Initializing expression: Allow self references
:PROPERTIES:
:CUSTOM_ID: pr-1432
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1432][#1432]].
** PR #1433: 1422 fn:hash: Revision
:PROPERTIES:
:CUSTOM_ID: pr-1433
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1433][#1433]].
** PR #1434: 1373 XQFO: Editorial
:PROPERTIES:
:CUSTOM_ID: pr-1434
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1434][#1434]].
** PR #1435: 1421 fn:unix-time: Revisions
:PROPERTIES:
:CUSTOM_ID: pr-1435
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1435][#1435]].
** PR #1436: 1323 Function parameters names: $href → $uri
:PROPERTIES:
:CUSTOM_ID: pr-1436
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1436][#1436]].
** PR #1437: 1325 Variadic System Functions limited to `fn:concat`
:PROPERTIES:
:CUSTOM_ID: pr-1437
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1437][#1437]].
** PR #1438: 1322 fn:collation-available (editorial)
:PROPERTIES:
:CUSTOM_ID: pr-1438
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1438][#1438]].
** PR #1439: 1235 Function Identity: Treating function items with identical bodies
:PROPERTIES:
:CUSTOM_ID: pr-1439
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1439][#1439]].
** PR #1440: 1387 Another tweak to build-uri
:PROPERTIES:
:CUSTOM_ID: pr-1440
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1440][#1440]].


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
