meeting/agenda/2024/09-17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 090 Agenda 2024-09-17</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 090 Agenda 2024-09-17</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/09-10.html">the previous meeting</a>. 
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 17 September 2024. The following meeting is scheduled
for 24 September.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-080-07: NW to update the build instructions in the README</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-087-01: DN to update PR #1228 to reflect MK’s compromise and update the vulnerabilities</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-01: NW to consider how best to add a dedication to MSM.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-03: MK to add an example of duplicate function-annotations being returned.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-088-04: [Someone] needs to update the processing model diagram needs vis-a-vis the static typing feature</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-089-01: CG to draft a PR that attempts to resolve the operators described in #755 to a smaller number of orthogonal choices.</li>
<li class="on"><code>[X]</code> QT4CG-089-02: WP to provide a more complete citation for the CRC-32 algorithm.
<ul class="org-ul">
<li>Shortly after the meeting, WP reported that the “cite this” button on the
spec landing page proposes: "IEEE Standard for Ethernet," in IEEE Std
802.3-2022 (Revision of IEEE Std 802.3-2018) , vol., no., pp.1-7025, 29 July
2022, doi: 10.1109/IEEESTD.2022.9844436.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1355">#1355</a>: 1351 Add "declare record" in XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1296">#1296</a>: 982 Rewrite of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Lookup returning path selection</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1444">#1444</a>: Implement improvement to bibligraphy entry for IEEE 802.3</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1414">#1414</a>: XSLT spec abstract, introduction</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1389">#1389</a>: fn:while-do: Optional error: will not terminate</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1442">#1442</a>: 1394 Add new default priority rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1414">#1414</a>: XSLT spec abstract, introduction</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1378">#1378</a>: 1375 bugs in pattern syntax</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1440">#1440</a>: 1387 Another tweak to build-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1439">#1439</a>: 1235 Function Identity: Treating function items with identical bodies</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1438">#1438</a>: 1322 fn:collation-available (editorial)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1437">#1437</a>: 1325 Variadic System Functions limited to `fn:concat`</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1436">#1436</a>: 1323 Function parameters names: $href → $uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1435">#1435</a>: 1421 fn:unix-time: Revisions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1434">#1434</a>: 1373 XQFO: Editorial</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1433">#1433</a>: 1422 fn:hash: Revision</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1432">#1432</a>: 1379 Initializing expression: Allow self references</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1431">#1431</a>: 1372 Unknown option: FORG0013 → XPTY0004</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1430">#1430</a>: 1427 Add element-number function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1429">#1429</a>: 1403 Align type tests</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1364">#1364</a>: 1314 Change to type() syntax to fix ambiguity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
</ul>
</div>
</div>

<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.6.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1252">#1252</a>: Add a new function `fn:html-doc`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1240">#1240</a>: $sequence-of-maps ? info()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1238">#1238</a>: XSLT on-no-match="shallow-copy-all" - revised rules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1235">#1235</a>: Function Identity: Treating function items with identical bodies</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1169">#1169</a>: Maps &amp; Arrays: Consistency &amp; Terminology</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1127">#1127</a>: Binary resources</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1021">#1021</a>: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/967">#967</a>: XPath Appendix I: Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/868">#868</a>: fn:intersperse → fn:join, array:join($arrays, $separator)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/826">#826</a>: Arrays: Representation of single members of an array</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/767">#767</a>: parse-html(): case of SVG element names</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/748">#748</a>: Parse functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: Rethrow errors; finally block</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/490">#490</a>: Control over schema validation in parse-xml(), doc(), etc.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/69">#69</a>: fn:document, fn:function-available: default arguments</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1364" class="outline-3">
<h3 id="pr-1364"><span class="section-number-3">2.1.</span> PR #1364: Change to type() syntax to fix ambiguity</h3>
<div class="outline-text-3" id="text-pr-1364">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1364">#1364</a>
</p>
</div>
</div>

<div id="outline-container-pr-1283" class="outline-3">
<h3 id="pr-1283"><span class="section-number-3">2.2.</span> PR #1283: 77b: Update expressions</h3>
<div class="outline-text-3" id="text-pr-1283">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>
</p>
</div>
</div>

<div id="outline-container-pr-1429" class="outline-3">
<h3 id="pr-1429"><span class="section-number-3">2.3.</span> PR #1429: Align type tests</h3>
<div class="outline-text-3" id="text-pr-1429">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1429">#1429</a>
</p>
</div>
</div>

<div id="outline-container-pr-1430" class="outline-3">
<h3 id="pr-1430"><span class="section-number-3">2.4.</span> PR #1430: 1427 Add element-number function</h3>
<div class="outline-text-3" id="text-pr-1430">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1430">#1430</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1431" class="outline-3">
<h3 id="pr-1431"><span class="section-number-3">2.5.</span> PR #1431: 1372 Unknown option: FORG0013 → XPTY0004</h3>
<div class="outline-text-3" id="text-pr-1431">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1431">#1431</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1432" class="outline-3">
<h3 id="pr-1432"><span class="section-number-3">2.6.</span> PR #1432: 1379 Initializing expression: Allow self references</h3>
<div class="outline-text-3" id="text-pr-1432">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1432">#1432</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1433" class="outline-3">
<h3 id="pr-1433"><span class="section-number-3">2.7.</span> PR #1433: 1422 fn:hash: Revision</h3>
<div class="outline-text-3" id="text-pr-1433">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1433">#1433</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1434" class="outline-3">
<h3 id="pr-1434"><span class="section-number-3">2.8.</span> PR #1434: 1373 XQFO: Editorial</h3>
<div class="outline-text-3" id="text-pr-1434">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1434">#1434</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1435" class="outline-3">
<h3 id="pr-1435"><span class="section-number-3">2.9.</span> PR #1435: 1421 fn:unix-time: Revisions</h3>
<div class="outline-text-3" id="text-pr-1435">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1435">#1435</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1436" class="outline-3">
<h3 id="pr-1436"><span class="section-number-3">2.10.</span> PR #1436: 1323 Function parameters names: $href → $uri</h3>
<div class="outline-text-3" id="text-pr-1436">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1436">#1436</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1437" class="outline-3">
<h3 id="pr-1437"><span class="section-number-3">2.11.</span> PR #1437: 1325 Variadic System Functions limited to `fn:concat`</h3>
<div class="outline-text-3" id="text-pr-1437">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1437">#1437</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1438" class="outline-3">
<h3 id="pr-1438"><span class="section-number-3">2.12.</span> PR #1438: 1322 fn:collation-available (editorial)</h3>
<div class="outline-text-3" id="text-pr-1438">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1438">#1438</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1439" class="outline-3">
<h3 id="pr-1439"><span class="section-number-3">2.13.</span> PR #1439: 1235 Function Identity: Treating function items with identical bodies</h3>
<div class="outline-text-3" id="text-pr-1439">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1439">#1439</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1440" class="outline-3">
<h3 id="pr-1440"><span class="section-number-3">2.14.</span> PR #1440: 1387 Another tweak to build-uri</h3>
<div class="outline-text-3" id="text-pr-1440">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1440">#1440</a>.
</p>
</div>
</div>
</div>


<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
